dtl-model-checking/instructions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-27 Wed 17:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Usage of the model checker</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Augusto Peres" />
</head>
<body>
<div id="content">
<h1 class="title">Usage of the model checker</h1>


<div id="outline-container-org8c57765" class="outline-2">
<h2 id="org8c57765"><span class="section-number-2">1</span> Expressing the formulas</h2>
<div class="outline-text-2" id="text-1">
<p>
The DTL formula we want to model check should be passed as one of the arguments.
To express the formulas parenthesis should be used whenever an operator is
use, this includes \(\wedge\), \(\implies\), \(\vee\).
</p>

<p>
For example \(@_1[p \implies q]\) should be expressed as <code>@_1((p)=&gt;(q))</code>. Spaces
should also not be used to express formulas. Communication formulas are
expressed as <code>c_2(otherformulas)</code>.
</p>

<p>
<b>Note</b>: When not using the bounded options it is not possible the usage of
 \(\vee\), \(\wedge\) or any other dual operators.
</p>
</div>
</div>

<div id="outline-container-org018aef1" class="outline-2">
<h2 id="org018aef1"><span class="section-number-2">2</span> Expressing transition systems</h2>
<div class="outline-text-2" id="text-2">
<p>
The transition system should be encoded in a file. The lines in that file must
be of the following form:
</p>

<ol class="org-ol">
<li><code>states 1 2 3 4</code>. This line says the states present in the system</li>
<li><code>initial 1 2</code>. This lines states the initial states</li>
<li><code>actions agent a1 a2</code>. This line states the actions of each agent. agent
should be an integer</li>
<li><code>symbols agent p1 p2 p1</code>. States the propositional symbols available to each
agent.</li>
<li><code>label state agent p1 p2</code>. States the propositional symbols in the language
of the agent that are present in the state.</li>
<li><code>state action state</code>. Describes the transition relation.</li>
</ol>
</div>
</div>


<div id="outline-container-org68a0aa5" class="outline-2">
<h2 id="org68a0aa5"><span class="section-number-2">3</span> Using the model checker</h2>
<div class="outline-text-2" id="text-3">
<p>
The model checker is used as a command line application with the following
options.
</p>
</div>

<div id="outline-container-org0d0e335" class="outline-3">
<h3 id="org0d0e335"><span class="section-number-3">3.1</span> Visializations</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Transition systems can be outputed to the graphviz format by calling
</p>

<div class="org-src-container">
<pre class="src src-shell">./Main -toGraphviz path-to-the-file-containing-the-transition-system
</pre>
</div>

<p>
This outputs the full the transition system and the full simplified transition
system, <i>i.e</i>, the transition system with all dead or unreachable states
removed.
</p>

<p>
This can be copy pasted <a href="http:webgraphviz.com">here</a> to visualize. 
</p>
</div>
</div>

<div id="outline-container-orgf98d04c" class="outline-3">
<h3 id="orgf98d04c"><span class="section-number-3">3.2</span> Model checking</h3>
<div class="outline-text-3" id="text-3-2">
<p>
To get a simple yes or no answer just use as
</p>

<div class="org-src-container">
<pre class="src src-shell">./Main -modelCheck &lt;path-to-transition-system&gt; &lt;formula&gt; &lt;number of agents&gt;
</pre>
</div>

<p>
This uses the default automata theoretic approach.
</p>

<p>
To use the bounded approach
</p>

<div class="org-src-container">
<pre class="src src-shell">./Main -modelCheck &lt;path-to-transition-system&gt; &lt;formula&gt; &lt;number of agents&gt; -bounded &lt;maxbound&gt;
</pre>
</div>

<p>
To get one counter example we use
</p>

<div class="org-src-container">
<pre class="src src-shell">./Main -oneCounterExample &lt;path-to-transition-system&gt; &lt;formula&gt; &lt;number of agents&gt;
</pre>
</div>

<p>
This outputs something of the form
</p>

<div class="org-src-container">
<pre class="src src-shell">CounterExample <span style="color: #707183;">[</span> <span style="color: #7388D6;">[</span><span style="color: #909183;">(</span>s1, x1<span style="color: #909183;">)</span>, <span style="color: #909183;">(</span>s2, x2<span style="color: #909183;">)</span>...<span style="color: #909183;">(</span>sn, x2<span style="color: #909183;">)</span><span style="color: #7388D6;">]</span>, <span style="color: #7388D6;">[</span><span style="color: #909183;">(</span>sn, xn<span style="color: #909183;">)</span>, ..., <span style="color: #909183;">(</span>sn, xn<span style="color: #909183;">)</span><span style="color: #7388D6;">]</span> <span style="color: #707183;">]</span>
</pre>
</div>

<p>
This corresponds to the infinite path in the dot product of DTS with the
automaton that witnesses the persistence property. Projecting the first
coordinates yields an infinite path in the transition function.
</p>

<p>
To use the bounded model checking approach
</p>

<div class="org-src-container">
<pre class="src src-shell">./Main -oneCounterExample &lt;path-to-transition-system&gt; &lt;formula&gt; &lt;number of agents&gt; -bounded &lt;max-bound&gt;
</pre>
</div>

<p>
The output should be something of the form
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #006699;">Just</span> <span style="color: #707183;">(</span>fromList <span style="color: #7388D6;">[</span><span style="color: #909183;">(</span><span style="color: #008000;">"0_a"</span>:True<span style="color: #909183;">)</span>..<span style="color: #909183;">(</span><span style="color: #008000;">"0_p1"</span>:True<span style="color: #909183;">)</span>...<span style="color: #7388D6;">]</span>, k<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Corresponding to the solution of the formula and the symbols present in each
state. The number before "_" indicates the action taken at that step. k
corresponds to the bound for which a counter example was found
</p>
</div>
</div>
</div>


<div id="outline-container-orgfc39882" class="outline-2">
<h2 id="orgfc39882"><span class="section-number-2">4</span> Some examples</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-shell">./Main -modelCheck t8States2Agents1.txt <span style="color: #008000;">"(@_1(p1))=&gt;~(@_2(q1))"</span> <span style="color: #D0372D;">2</span>
True


./Main -modelCheck t8States2Agents1.txt <span style="color: #008000;">"@_2(X(c_1(p2)))"</span> <span style="color: #D0372D;">2</span>
True


./Main -modelCheck t8States2Agents4.txt <span style="color: #008000;">"(@_1(c_2(q1)))=&gt;(@_1(p1))"</span> <span style="color: #D0372D;">2</span>
False


./Main -modelCheck t8States2Agents4.txt <span style="color: #008000;">"@_1(F((p1)/\\(p2)))"</span> <span style="color: #D0372D;">2</span> -bounded <span style="color: #D0372D;">0</span>
True

./Main -modelCheck t8States2Agents4.txt <span style="color: #008000;">"@_1(F((p1)/\\(p2)))"</span> <span style="color: #D0372D;">2</span> -bounded <span style="color: #D0372D;">2</span>
False


./Main -oneCounterExample t8States2Agents4.txt <span style="color: #008000;">"@_1(F((p1)/\\(p2)))"</span> <span style="color: #D0372D;">2</span> -bounded <span style="color: #D0372D;">2</span>
<span style="color: #006699;">Just</span> <span style="color: #707183;">(</span>fromList <span style="color: #7388D6;">[</span><span style="color: #909183;">(</span><span style="color: #D0372D;">0_</span><span style="color: #008000;">"a"</span>,True<span style="color: #909183;">)</span>,<span style="color: #909183;">(</span><span style="color: #D0372D;">0_</span><span style="color: #008000;">"b"</span>,False<span style="color: #909183;">)</span>,<span style="color: #909183;">(</span><span style="color: #D0372D;">0_</span><span style="color: #008000;">"c"</span>,False<span style="color: #909183;">)</span>,<span style="color: #909183;">(</span><span style="color: #D0372D;">0_p1,False</span><span style="color: #909183;">)</span>,<span style="color: #909183;">(</span><span style="color: #D0372D;">0_p2,False</span><span style="color: #909183;">)</span>,<span style="color: #909183;">(</span><span style="color: #D0372D;">0_q1,False</span><span style="color: #909183;">)</span>,<span style="color: #909183;">(</span><span style="color: #D0372D;">1_</span><span style="color: #008000;">"a"</span>,False<span style="color: #909183;">)</span>,<span style="color: #909183;">(</span><span style="color: #D0372D;">1_</span><span style="color: #008000;">"b"</span>,True<span style="color: #909183;">)</span>,<span style="color: #909183;">(</span><span style="color: #D0372D;">1_</span><span style="color: #008000;">"c"</span>,False<span style="color: #909183;">)</span>,<span style="color: #909183;">(</span><span style="color: #D0372D;">1_p1,True</span><span style="color: #909183;">)</span>,<span style="color: #909183;">(</span><span style="color: #D0372D;">1_p2,False</span><span style="color: #909183;">)</span>,<span style="color: #909183;">(</span><span style="color: #D0372D;">1_q1,False</span><span style="color: #909183;">)</span><span style="color: #7388D6;">]</span>,1<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Augusto Peres</p>
<p class="date">Created: 2020-05-27 Wed 17:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
